# coding=utf-8





class RULE():
    def __init__(self, key=None, tmp=None, discb=None, act=None):
        self.items = []

    def add_rule(self, tup):
        self.items.append(tup)


class Scene():
    def __init__(self, base=None, askword=None, action=None, bad=None):
        self.rule = RULE()
        if askword == None: askword = []
        if action == None: action = []
        self.action = action
        self.askword = askword
        if bad == None: bad = []
        self.bad = bad
        self.BASE = base
        self.ans = 'default-answer'


############################################流量
ll = Scene(None)  # 流量
webdata = [u'流量', u'兆', u'香蕉', u'流泪', u'夜间包', u'叠加包', u'安心包']
ll.rule.add_rule((webdata,))

##############################
llzy = Scene(ll)  # 流量清零相关
llzy.rule.add_rule(([u'清零', u'转移', u'总计', u'延'],))
llzy.rule.add_rule(([u'还能 使用', u'保留'], [u'剩余', u'用不完']))
llzy.rule.add_rule(([u'月底', u'月初', u'本月', u'下月', u'上月'], [u'叠加', u'保留', u'剩余', u'用不完', u'继续', u'还']))

##############################
llzytc = Scene(llzy, askword=[u'怎么', u'为何', u'什么', u'是否', u'哪里'],
               action=[u'叠加', u'如', u'包', u'超出', u'分', u'支持', u'没有用完', u'促销', u'查询', u'用不完', u'能否', u'享受',
                       u'使用', u'不能', u'继续', u'会', u'剩余', u'包括', u'转入', u'优惠', u'升为', u'通话时间', u'需要', u'购买',
                       u'共享', u'清零', u'转移', u'畅游', u'携带', u'服务', u'上网', u'总计', u'赠送', u'还有', u'转网', u'续存', u'办理', u'收到',
                       u'包含', u'是否', u'介绍', u'不变', u'获得', u'过来', u'说', u'关闭', u'自动', u'打电话',
                       u'保留'])  # 流量不清零的套餐范围
llzytc.ans = u'流量当月不清零服务的套餐包含所有按流量计费的手机月套餐，基础套餐和流量可选包、闲时套餐等，均可享受当月不清零服务。'
llzytc.rule.add_rule(([u'套餐', u'流量包', u'香蕉', u'飞享', u'夜间'], [u'清零', u'叠加']))
llzytc.rule.add_rule(([u'套餐', u'流量包', u'香蕉', u'飞享', u'夜间'], [u'转移', u'保留', u'剩余', u'继续', u'用不完'], [u'下月']))

##############################
llzygg = Scene(llzy, askword=[u'怎么', u'为何', u'是否'],
               action=[u'剩余', u'服务', u'更改', u'没有', u'是否', u'不变', u'上网', u'转移', u'用不完', u'能否',
                       u'使用', u'不能', u'清零', u'保留', u'继续', u'续存', u'遗留'])  # 变更套餐后能否转移流量
llzygg.ans = u'流量当月不清零服务是基于客户套餐提供的延长周期服务行为，您若变更套餐，属于改变现有的套餐，原套餐失效，因此变更套餐后，原套餐不可享受流量不清零服务。'
llzygg.rule.add_rule(([u'更改'],))

##############################
llzysx = Scene(llzy, askword=[u'怎么', u'为何', u'什么'],
               action=[u'优先', u'扣减', u'剩余', u'扣费', u'用不完', u'计费', u'使用', u'剩余', u'清零', u'转移'])  # 流量转移扣费顺序
llzysx.ans = u'结转流量等同于原套餐流量使用规则，当月存在结转流量时，同一类型的流量优先扣减上月结转的剩余流量，再扣减套餐内流量。不同类型的流量，' \
             u'按照原有的扣费顺序，计费规则不变。举例说明：如您存在上月国内流量结转流量，本月闲时流量，本月国内流量时，先扣减本月闲时流量，' \
             u'再扣减上月国内流量结转流量，再扣减国内流量结转流量。'
llzysx.rule.add_rule(([u'先', u'顺序'], [u'流量', u'套餐'], [u'清零', u'用', u'转移', u'剩余', u'用不完', u'计费']))

##############################
llzyxh = Scene(llzy, askword=[u'怎么', u'是否', u'什么'],
               action=[u'剩余', u'服务', u'是否', u'销户', u'携带', u'延时', u'总计', u'办理', u'保留', u'使用', u'享受', u'转网', u'清零',
                       u'没有'])  # 流量停机后能否转移
llzyxh.ans = u'您的手机号码若整月停机时，剩余流量不可结转至次月。'
llzyxh.rule.add_rule(([u'销户'], [u'清零', u'保留', u'总计', u'影响', u'延']))
llzyxh.rule.add_rule(([u'销户'], [u'用不完']))

##############################
llzyjs = Scene(llzy,
               action=[u'转过', u'叠加', u'还有', u'需要', u'没用', u'用不完', u'没到', u'自动', u'回复',
                       u'使用', u'不能', u'介绍', u'移动', u'说好', u'剩余', u'不见', u'没有', u'结算',
                       u'购买', u'计算', u'清零', u'转移', u'收取', u'延时', u'对待', u'总计', u'赠送', u'抽取', u'办理',
                       u'收到', u'继续', u'服务', u'缴费', u'总计', u'预约', u'过来', u'解决'],
               bad=[u'香蕉', u'飞享', u'夜间', u'套餐', u'流量包', u'可选包', u'至尊包', u'别人', u'好友'])
# 流量转移介绍
llzyjs.rule.add_rule(([u'转移', u'清零', u'继续', u'延'],))
llzyjs.rule.add_rule(([u'还能', u'可以'], [u'使用']))
llzyjs.rule.add_rule(([u'需要', u'可以'], [u'申请', u'办理']))
llzyjs.rule.add_rule(([u'用不完'], [u'吗', u'是否', u'怎么'], [u'解决', u'可以', u'接着', u'总计']))
llzyjs.ans = u'流量当月不清零服务是指：您手机号码中的所有按流量计费的手机月套餐，基础套餐和流量可选包、闲时套餐等，若套餐内的流量当月没有使用完，剩余流量可' \
             u'以结转至次月使用，结转流量次月月底失效。该项服务为系统默认开通，无需订购。'

##############################
llcx = Scene(ll, askword=[u'多少', u'怎么', u'为何', u'什么', u'哪里', u'能否'],
             action=[u'不知', u'要求', u'消费', u'收到', u'点击', u'回复', u'赠送', u'不懂', u'结算', u'欠费', u'办理', u'超过', u'请求', u'收不到',
                     u'需要', u'使用', u'变化', u'输入', u'剩余', u'看见', u'没有', u'超出', u'未到账',
                     u'设置', u'登录', u'进不去', u'叠加', u'扣除', u'属于', u'计算', u'总计', u'解决', u'加载', u'输入', u'进去', u'可用',
                     u'介绍', u'查询'
                     ], bad=[u'继续', u'别人', u'转'])  # 流量查询
llcx.ans = u'您可用本机编辑“CXYL”发至10086进行查询，或者拨打1008611查询您手机号码的套餐剩余流量（查询结果将在10分钟内以短信形式下发到您手机上）。余量查询每日最多可查3次。'
llcx.rule.add_rule(([u'查询', u'剩余', u'存量'],))
llcx.rule.add_rule(([u'还有'], [u'多少']))

##############################
llbz = Scene(ll, askword=[u'怎么', u'为何', u'能否', u'什么', u'哪里'],
             action=[u'计费', u'还有', u'接收', u'查询', u'使用', u'不好', u'解释', u'消费', u'交费', u'莫名', u'解决', u'赠送',
                     u'出现', u'质疑', u'介绍', u'欠费', u'超出', u'没有', u'没用', u'购买', u'办理', u'收取', u'消费', u'说明', u'能用',
                     u'有没有', u'上网', u'显示', u'使用', u'通话时间', u'欠费', u'打电话', u'干嘛', u'发信息', u'搞错', u'扣除', u'自动',
                     u'预约', u'无所谓', u'查不到', u'去向', u'充电', u'计费'], bad=[u'如果'])  # 流量不准确
llbz.ans = u'您可以登录北京移动门户网站，查询您手机号码的上网详单，在详单中会有您每次上网的记录，您可进行参考一下。'
llbz.rule.add_rule(([u'超出', u'不准', u'错误'], [u'可是', u'明明', u'没有', u'没用', u'莫名']))
llbz.rule.add_rule(([u'计费', u'计'], [u'不准', u'乱', u'错误']))
llbz.rule.add_rule(([u'怎么', ], [u'超', u'没'], [u'了']))

llbz.rule.add_rule(([u'流量 不准', u'流量 错误', u'费 不准', u'费 错误'],))

###########################################wifi
wf = Scene()  # wifi
wf.rule.add_rule(([u'WLAN'],))

##############################
wfbl = Scene(wf, askword=[u'怎么', u'什么'],
             action=[u'办理', u'是', u'想要', u'要求', u'叠加', u'计费', u'上网',
                     u'优惠', u'不用', u'提示', u'服务', u'扣费', u'活动', u'断网', u'介绍', u'连接'],
             bad=[u'咪咕', u'密码', u'音乐', u'座机'])  # wifi办理
wfbl.ans = u'WLAN流量套餐分为5/10/20/30/50/100元6档，分别包含300MB/700MB/1.5GB/2.8GB/5GB/20GB国内（不含港澳台）流量，超出后0.1元/MB，可在CMCC或CMCC-WEB网络下使用，单个账号费用每月500元封顶，每月限50GB流量。您可以发送KTWLAN5/KTWLAN10/KTWLAN20/KTWLAN30/KTWLAN50/KTWLAN100至' \
           u'10086，分别开通相对应的套餐。温馨提示：未开通WLAN功能或已开通WLAN标准套餐的客户，开通WLAN流量套餐时当月生效，每月最后一天19点后无法办理。'
wfbl.rule.add_rule(([u'办理v'],))
wfbl.rule.add_rule(([u'怎么办'],))
wfbl.rule.add_rule(([u'怎么'], [u'计费']))
wfbl.rule.add_rule(([u'哪些', u'哪个'], [u'套餐']))

##############################
wfsy = Scene(wf, askword=[u'怎么', u'什么', u'何时'], bad=[u'用完', u'超出', u'音乐', u'密码'])  # wifi使用
wfsy.ans = u'WLAN介绍：北京移动面向客户推出。WLAN是当前主流的无线移动上网方式之一，又称WIFI，开通后，在中国移动WLAN覆盖地区，可利用笔记本电脑、手机终端等以无线方式高速接入互联网，WLAN传输速率最大可达11Mb/s。目前主要包含以下几种套餐：WLAN流量套餐、WLAN高校套餐、WLAN包单位时间预付费电子卡。' \
           u'WLAN使用方法：只要有WLAN的覆盖，在电脑或手机的无线网络连接中，连接CMCC或CMCC - WEB无线网络，连接后，打开浏览器输入任意地址，会弹出登录界面，在该界面的用户名处，输入手机号码，在静态密码处，输入WLAN密码，点击登录即可。如果想不起WLAN密码，可以重置WLAN密码或选择动态密码登录，' \
           u'注：请保留登录页，点击该页面的“下线”按钮方可正常下线。WLAN标准资费为0.1元 / MB。'
wfsy.rule.add_rule(([u'怎么'], [u'使用', u'收费']))
wfsy.rule.add_rule(([u'什么'], [u'是', u'叫', u'做什么']))
wfsy.rule.add_rule(([u'为什么'], [u'办理']))
wfsy.rule.add_rule(([u'可以'], [u'连接', u'使用'], [u'吗', u'何时']))

##############################
wfcc = Scene(wf, askword=[u'怎么', u'什么'])  # wifi超出怎么收费
wfcc.ans = u'WLAN流量套餐超出介绍：面向全球通、动感地带、神州行推出，分为5/10/20/30/50/100元6档，分别包含300MB/700MB/1.5GB/2.8GB/5GB/20GB' \
           u'国内（不含港澳台）流量，超出后0.1元/MB，可在CMCC或CMCC-WEB网络下使用，单个账号费用每月500元封顶，每月限50GB流量。'
wfcc.rule.add_rule(([u'超', u'用完', u'套餐外'], [u'计费', u'消费', u'资费', u'钱', u'怎么办', u'续约']))

###############################################实名制
smz = Scene()
smz.rule.add_rule(([u'实名'],))
##############################
smzbl = Scene(smz, askword=[u'怎么'], action=[u'办理', u'实名', u'需要', u'登记', u'使用', u'补办'], bad=[u'一定', u'不', u'已经'])
smzbl.ans = u'若您是已在网客户，则可在微信中，成功关注“中国移动10086”微信公众号后，进入该公众号，依次点击“我要办理”--“实名认证”--“实名补登记”，并按照页面提示完成实名认证操作。'
smzbl.rule.add_rule(([u'怎么 实', u'怎么 办', u'怎么办', u'怎么 登'],))
smzbl.rule.add_rule(([u'办理', u'补办', u'登记'],))
smzbl.rule.add_rule(([u'办理'], [u'需要']))
smzbl.rule.add_rule(([u'可以 实', u'可以 办', u'可以 补'],))

##############################
smzsx = Scene(smz, askword=[u'什么', u'是否', u'为何'], action=[u'过期', u'实名', u'登记', u'使用', u'是否', u'介绍', u'自动'])
smzsx.ans = u'您购买移动手机号码后，请您在完成实名登记的1天内激活使用购买的号卡，否则需要重新进行实名登记。若您的号卡已实名制，则不受限期激活的限制。'
smzsx.rule.add_rule(([u'过期'],))
smzsx.rule.add_rule(([u'实名'], [u'有效期']))
smzsx.rule.add_rule(([u'实名'], [u'有效']))

##############################
smzyx = Scene(smz, askword=[u'什么', u'怎么', u'是否'], action=[u'实名', u'需要', u'登记', u'使用', u'完成', u'影响'])
smzyx.ans = u'根据《中华人民共和国反恐怖主义法》、《全国人民代表大会常务委员会关于加强网络信息保护的决定》、《电话用户身份信息登记规定》等法律法规' \
            u'的要求，以及工业和信息化部《关于贯彻落实<反恐怖主义法>等法律规定 进一步做好电话用户真实身份信息登记工作的通知》（工信部网安[2016]182号）的' \
            u'工作要求，对于身份信息登记不完整的号码' \
            u'，均需进行补登记。2016年10月15日起，将依法对非实名号码暂停通信服务。为不影响您的使用，请尽快办理实名。'
smzyx.rule.add_rule(([u'影响', u'后果'], [u'不', u'非', u'没', u'缺失']))
smzyx.rule.add_rule(([u'不愿v 实名', u'没有 实名', u' 不 实名'],))
smzyx.rule.add_rule(([u'需要v 实名', ], [u'吗']))
# smzyx.rule.add_rule(([u'影响'],))
##############################

smzxy = Scene(smz, askword=[u'是否', u'什么', u'何时'], action=[u'实名', u'购买', u'需要', u'登记', u'使用', u'完成', u'影响', u'补录'],
              bad=[u'本人'])
smzxy.ans = u'"1、若您需要新购买手机号码，则需在您购买号码激活前进行实名登记，未完成实名制认证且未完成实名登记的号码仅可充值成功但不能激活成功。' \
            u'2、若您的手机号码属于已在网的情况：对于尚未真实登记身份信息或身份信息登记不完整的手机号码，均需进行实名登记。"'
smzxy.rule.add_rule(([u'需要', u'得'], [u'吗', u'是否']))
smzxy.rule.add_rule(([u'情况', u'何时', u'临时'], [u'需要']))
smzxy.rule.add_rule(([u'意思'], [u'什么']))

##################################################积分与星级
jf = Scene()
jf.rule.add_rule(([u'积分', u'星级'],))
#######################################
jfjf = Scene(jf, askword=[u'什么', u'怎么', u'为何', u'是否' u'何时'],
             action=[u'获得', u'介绍', u'计算', u'增加', u'过期', u'消费', u'总计', u'清零'],
             bad=[u'现金', u'流量', u'用处', u'宽带', u'飞信', u'商城', u'密码', u'更改'])  # 什么是积分
jfjf.ans = u'"如何参加积分计划：已开通积分计划且享受一星及以上服务的客户，可按月累计消费积分，您也可以通过参与营销活动获得促销回馈积分。未开通积分计划但享受一星及以上服务的客户，可以实名制后主动申请开通积分计划(（短信发送KTJF至10086），享受积分回馈服务。' \
           u'积分计算规则：非星级客户不再累计消费积分，但已有存量积分进行不清零。1、""和积分""由消费积分与促销回馈积分两个部分组成。2、消费积分：中国移动根据您的客户星级及每月的话费账单金额按月为您累积""和积分""。消费积分由""每月话费账单（不含赠送减免部分）消费积分""+""星级倍享积分""两部分组成。并按照""消费积分星级倍享系数""规则计算。不足1""和积分""的数值向上取整，违约金不计算积分。已开通积分计划的客户，""消费积分星级倍享系数""根据您的月消费和星级合并计算得出。' \
           u'3、促销回馈积分：参与中国移动促销、服务活动等即有机会获得促销回馈积分。温馨提：（1）过户：您办理过户后，原账户中的积分均转入新客户账户中，转入后的促销回馈积' \
           u'分有效期不变。新账户中的积分，按新账户对应的星级继续累积消费积分。（2）停机：手机号码处于停机（含欠费停机、申请停机等各种形式的停机）状态时，积分账户冻结，暂时不能使用积分业务。' \
           u'（3）销号：手机号码在销号后（含欠费销号和申请销号），积分账户余额将会自动清零，建议您在销户前用积分兑换相应物品。"'
jfjf.rule.add_rule(([u'什么', u'意思', u'介绍', u'有效期', u'清零', u'到期', u'规定', u'作用'], [u'积分']))
jfjf.rule.add_rule(([u'怎么'], [u'得', u'增', u'有', u'计算'], [u'积分']))
jfjf.rule.add_rule(([u'何时', u'时间', u'吗', u'是否'], [u'过期'], [u'积分']))

########################################
jfxj = Scene(jf, askword=[u'什么', u'怎么'], action=[u'服务', u'评定', u'查询', u'', u'计算', u'增加'])  # 什么是星级
# jfxj.rule.add_rule(([u'星级'], [u'是什么', u'什么是']))
jfxj.ans = u'星级服务，是中国移动在整合原有服务体系的基础上，面对广大老客户推出的一系列专属服务。具体而言，是为网龄长、消费稳定且无欠费的优质客' \
           u'户提供的积分倍享、话费透支、10086优先接入等多种差异化专属高价值服务，是对于客户长期支持中国移动的回馈。星级最高为五星，星级越高、可享' \
           u'受的服务权益越多。新客户号码从入网起即可以逐步累计相应的消费记录！每个号码的星级每月动态调整；如星级调整，各项星级服务的标准将根据最新' \
           u'星级同步调整。若号码过户、销户后，星级及相应的权益自动取消。成为星级客户的好方法：不换号、免费升级4G手机卡，并开通4G套餐半年以上，即' \
           u'可成为星级客户，享更多礼遇！编辑短信“CXXJ”或者“XJFW”或者“星级服务”发送到10086，也可以拨打10086客户服务热线，或者直接登陆www.10086.cn网' \
           u'上营业厅-我的星级，查询您的星级和享受的星级服务权益。' \
           u'温馨提示：' \
           u'（一）客户办理本地换号业务、换套餐时，客户星级可携带。' \
           u'（二）客户星级不可转移，即客户过户、销户后客户星级自动取消，销户重入网时客户星级不可恢复。' \
           u'（三）客户因恶意欠费、欠费销户等原因被列入欠费黑名单后，同一证件下所有号码暂停评级，直至所有历史欠费付清且客户证件号码得以从黑名' \
           u'单中去除后，从第7个月可恢复星级评定。'
jfxj.rule.add_rule(([u'什么', u'多少', u'怎么', u'还有'], [u'星级']))
jfxj.rule.add_rule(([u'用户', u'客户'], [u'星级']))
jfxj.rule.add_rule(([u'星级'],))
##############################
jfcx = Scene(jf, askword=[u'怎么', u'多少', u'哪里'], action=[u'还有', u'查询', u'达到', u'需要', u'使用', u'剩余'],
             bad=[u'流量', u'飞信', u'密码', u'现金', u'商品', u'发货'])  # 积分查询
jfcx.ans = u'积分查询：本机编辑JF(大小写均可)到10086，即可查询。'
jfcx.rule.add_rule(([u'查询', u'剩余'], [u'积分']))
jfcx.rule.add_rule(([u'等级'], [u'积分']))
jfcx.rule.add_rule(([u'有', u'是'], [u'多少', u'吗'], [u'积分']))
##############################
jfdh = Scene(jf, askword=[u'怎么', u'为何', u'哪里', u'什么'],
             action=[u'使用', u'更改', u'需要', u'不能', u'希望', u'失败', u'缴费', u'服务', u'介绍'])  # 积分对换
# jfdh.rule.add_rule(([u'更改'],))
jfdh.ans = u'积分兑换：您可通过短信、门户网站等方式兑换积分产品。'
jfdh.rule.add_rule(([u'积分 更改v', u'怎么 更改v'],))
jfdh.rule.add_rule(([u'更改v'], [u'积分']))
jfdh.rule.add_rule(([u'怎么 使用', u'用处'], [u'积分'],))
##############################
jfmy = Scene(jf, askword=[u'怎么', u'为何', u'什么'], action=[u'没有', u'查询', u'消费', u'使用', u'移动', u'显示', u'获得', u'总计'],
             bad=[u'商场', u'兑换', u'更改', u'商城', u'密码', u'别人', u'发货'])
jfmy.ans = u'"积分适用品牌：全球通、动感地带、神州行升级版标准卡、神州行畅听卡、神州行家园卡、神州行5元卡、畅享卡、无线座机卡、小帮手关爱卡等。' \
           u'特殊说明：神州行客户需进行实名制认证，再申请开通该业务后，积分才可正常累计。针对“信用等级4级及以上”的神州行客户，直接提供神州行积分计划服务，无需办理。"'
jfmy.rule.add_rule(([u'没有', u'零', u' 0', u'这么少'], [u'积分']))
jfmy.rule.add_rule(([u'全球通', u'动感地带', u'神州行', u'畅享卡'], [u'积分']))

aabbcc = Scene(wf)
# aabbcc.rule.add_rule(([u'顺序',u'先'],[u'清零',u'转移',u'剩余']))
aabbcc.rule.add_rule(([u'完']))
# aabbcc.rule.add_rule(([u'销户'], [u'清零', u'转移']))



scenelib = [llzysx, llzygg, llzytc, llzyjs, llzyxh, llbz, llcx, jfdh, jfcx, jfjf, jfmy, jfxj, smzbl, smzsx, smzyx,
            smzxy, wfbl, wfcc, wfsy]
scenelibname = ['traffic_use_orders', 'traffic_package_changed', 'traffic_package_scope', 'traffic_intro',
                'traffic_stop',
                'traffic_error', 'traffic_check', 'score_exchange', 'score_check', 'score_intro', 'score_empty_reason',
                'star_intro', 'name_apply', 'name_expired_time', 'name_affects', 'name_need', 'wlan_apply',
                'wlan_exceed', 'wlan_intro']

scname = [u'流量当月不清零的扣费顺序', u'变更套餐后，剩余流量次月能否使用', u'流量当月不清零的套餐范围', u'流量不清零规则介绍', u'停机后是否可以享受不清零服务', u'流量查询结果不准确',
          u'手机剩余流量的其他查询方式', u'积分兑换', u'积分查询', u'什么是积分', u'为什么我还没有积分', u'什么是星级服务', u'如何进行实名制登记', u'实名制会失效吗',
          u'不完整实名登记的影响', u'什么情况下需要实名登记', u'开通wlan套餐', u'超出套餐后怎么收费', u'wlan是什么及如何使用']
nm = {i: j for i, j in zip(scenelib, scenelibname)}
tsc = {i: j for i, j in zip(scenelib, scname)}

#
#
# for i,j in zip(scenelibname,scname):
#     print i,' ',j
